app/controllers/items_controller.rb

    def index
    i = Item.all
---
SELECT "items".* FROM "items"

    def create
        i = Item.create(items_params)
---
INSERT INTO "items" ("name", "item_type", "character_type", "image", "effect", "stats", "cost") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", nil], ["item_type", nil], ["character_type", nil], ["image", nil], ["effect", nil], ["stats", nil], ["cost", nil]]

    def update
        i = Item.find(params[:id])
        item = i.update(:image => params[:image])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "items" SET "image" = $1 WHERE "items"."id" = $2  [["image", "https://static.wikia.nocookie.net/leagueoflegends/images/c/c2/Turbo_Chemtank_item.png"], ["id", 3]]

    def show
        i = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]